       Identification Division.
           Program-ID. Chapter6-1.
               Author. Anthony Downs
               Installation.
               Date-Written. Marhc 18, 2016.
               Date-Compiled.
               Security.
               
       Environment Division.
           Configuration Section.
               Special-Names.
               
           Input-Output Section.
               File-Control.
               
               I-O-Control.
               
       Data Division.
           File Section.
           
           Working-Storage Section.
           
           Local-Storage Section.
           
           Linkage Section.
           
           Report Section.
           
       Procedure Division.
       
           Stop "Press <CR> to End Program"
           Stop Run.
           
       End Program.