      * HeaderMain
       01  HeaderMain.
           05                  PIC X(21)   value spaces.
           05                  PIC X(29)   value 'Agile Company Customer Report'.
           05  HeaderMain2.
               10                  PIC X(17)   value spaces.
               10                  PIC X(41)   value 'Prepared for the Company By Anthony Downs'.
           05  HeaderDate          PIC 99/99/9999.
           05                      PIC X(10)   value spaces.
           05  HeaderTime          PIC XX/XX/XX.