      * HeaderColumns
       01  PIC X(5)    value spaces.
       01  PIC X(9)    value 'Name'.
       01  PIC X(22)   value 'Date of Transaction'.
       01  PIC X(21)   value 'Amount of Transaction'.
