      * HeaderColumns
       01  HeaderColumns. 
           05  PIC X(4)    value spaces.
           05  PIC X(7)    value 'Name'.
           05  PIC X(22)   value 'Date of Transaction'.
           05  PIC X(21)   value 'Amount of Transaction'.
